In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.read_csv("Salary_Data.csv")
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [2]:
df.isnull().sum()

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [3]:
df['Age'].fillna(df['Age'].mode()[0], inplace=True)

In [4]:
df['Gender'].fillna(df['Gender'].mode()[0], inplace=True)

In [5]:
df.isnull().sum()

Age                    0
Gender                 0
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [6]:
df['Education Level'].fillna(df['Education Level'].mode()[0], inplace=True)

In [7]:
df['Job Title'].fillna(df['Job Title'].mode()[0], inplace=True)

In [8]:
df['Years of Experience'].fillna(df['Years of Experience'].mode()[0], inplace=True)

In [9]:
df['Salary'].fillna(df['Salary'].mode()[0], inplace=True)

In [10]:
df.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [11]:
df['Gender'].replace({'Male':1 , 'Female':2}, inplace=True)

In [12]:
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,1,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,2,Master's,Data Analyst,3.0,65000.0
2,45.0,1,PhD,Senior Manager,15.0,150000.0
3,36.0,2,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,1,Master's,Director,20.0,200000.0

In [13]:
df['Gender'].value_counts()

Gender
1        3676
2        3014
Other      14
Name: count, dtype: int64

In [14]:
df['Gender'].replace({'Other':3}, inplace=True)

In [15]:
df['Gender'].value_counts()

Gender
1    3676
2    3014
3      14
Name: count, dtype: int64

In [16]:
df['Age'].mean()

33.61888424821002

In [21]:
df.groupby('Age')['Salary'].std()

Age
21.0        0.000000
22.0    11880.865333
23.0    18035.442395
24.0    26124.985328
25.0    28777.491135
26.0    31350.288104
27.0    33176.810762
28.0    40685.862170
29.0    40882.104745
30.0    44141.603325
31.0    49170.282924
32.0    40343.238208
33.0    41148.195089
34.0    38029.021237
35.0    28282.573449
36.0    35135.187603
37.0    32923.368331
38.0    30591.206601
39.0    37107.978657
40.0    38457.087535
41.0    32816.117854
42.0    23802.443693
43.0    19730.539525
44.0    18377.397914
45.0    26086.731136
46.0    16885.301897
47.0    11582.239177
48.0    16884.955629
49.0    18146.688329
50.0    18832.132979
51.0    27080.013909
52.0    15720.313915
53.0    11812.715266
54.0     8875.741981
55.0    10884.112294
56.0     4507.360808
57.0    31698.597168
58.0     4496.983539
60.0     6855.522467
61.0        0.000000
62.0        0.000000
Name: Salary, dtype: float64

In [22]:
df.groupby('Age')['Salary'].mean()

Age
21.0     25000.000000
22.0     32910.933333
23.0     47192.009615
24.0     51052.250000
25.0     63730.387324
26.0     66137.053299
27.0     77673.836224
28.0     84140.368298
29.0     85764.750000
30.0    100903.955457
31.0    114451.649315
32.0    120500.179487
33.0    127425.266332
34.0    132065.291262
35.0    119365.835000
36.0    134092.748227
37.0    146939.461538
38.0    138185.570470
39.0    147282.715190
40.0    149862.989130
41.0    155235.565891
42.0    155952.477273
43.0    165409.398734
44.0    160518.873016
45.0    170334.291667
46.0    171242.362745
47.0    178750.106383
48.0    192723.846939
49.0    189013.582418
50.0    190849.897727
51.0    200356.066667
52.0    187629.379310
53.0    180806.571429
54.0    189816.250000
55.0    198482.187500
56.0    196577.636364
57.0    176993.777778
58.0    195715.428571
60.0    186132.400000
61.0    200000.000000
62.0    200000.000000
Name: Salary, dtype: float64